import {FlatList} from 'react-native';
import React from 'react';

import {Box, Text, Container, Pressable} from 'native-base';
import {useNavigation} from '@react-navigation/core';
import Svg, {Path} from 'react-native-svg';
type Props = {
  item: any;
  index: number;
};
const Item: React.FC<Props> = ({item, index}) => {
  //   const navigation = useNavigation();
  return (
    <Box borderRadius={10} my={3} mx={1} p={3} py={4} px={5} borderWidth={1}>
      <Box flexDir={'row'} width="100%" alignItems={'center'}>
        <Box
          bg="primary.500"
          height={26}
          width={26}
          justifyContent={'center'}
          alignItems={'center'}
          borderRadius={100}>
          <Svg width="16" height="16" viewBox="0 0 16 16" fill="none">
            <Path
              d="M14.2169 8.92578L14.2364 13.6162C14.2364 13.6982 14.2308 13.7744 14.2225 13.8535V14.3281C14.2225 14.9756 13.7252 15.5 13.1114 15.5H12.6669C12.6364 15.5 12.6058 15.4736 12.5752 15.4971C12.5364 15.4736 12.4975 15.5 12.4586 15.5H10.8891C10.2752 15.5 9.77802 14.9756 9.77802 14.3281V11.75C9.77802 11.2314 9.3808 10.8125 8.88913 10.8125H7.11136C6.61969 10.8125 6.22247 11.2314 6.22247 11.75V14.3281C6.22247 14.9756 5.72524 15.5 5.11136 15.5H3.55858C3.51691 15.5 3.47524 15.4971 3.43358 15.4941C3.40024 15.4971 3.36691 15.5 3.33358 15.5H2.88913C2.27552 15.5 1.77802 14.9756 1.77802 14.3281V11.0469C1.77802 11.0205 1.77886 10.9912 1.78052 10.9648V8.92578H0.890522C0.389689 8.92578 0.000244141 8.5127 0.000244141 7.98535C0.000244141 7.72168 0.0836886 7.4873 0.2783 7.28223L7.40024 0.734844C7.59469 0.529355 7.81691 0.5 8.01136 0.5C8.2058 0.5 8.42802 0.558711 8.59747 0.705488L11.5558 3.4502V2.375C11.5558 1.85732 11.953 1.4375 12.4447 1.4375H13.3336C13.8252 1.4375 14.2225 1.85732 14.2225 2.375V5.91992L15.6891 7.28223C15.9114 7.4873 16.0252 7.72168 15.9947 7.98535C15.9947 8.5127 15.578 8.92578 15.1058 8.92578H14.2169Z"
              fill="white"
            />
          </Svg>
        </Box>
        <Text
          marginLeft={2}
          fontSize={14}
          fontWeight={800}
          color="primary.500"
          fontFamily={'Cairo'}>
          عنوان {index + 1}
        </Text>
      </Box>
      <Box>
        <Text my={1} textAlign={'left'} fontFamily={'Cairo'}>
          {item.name} - (123) 456 789 012
        </Text>
        <Text
          color="gray.700"
          fontSize={13}
          opacity={0.7}
          fontWeight={500}
          textAlign={'left'}
          fontFamily={'Cairo'}>
          رقم البيت - اسم الشارع - اسم القطاع - اسم المدينة - اسم الدولة
        </Text>
      </Box>

      <Box flexDir={'row'} marginTop={3}>
        <Pressable onPress={() => navigation.navigate('Product')}>
          {({isPressed}) => {
            return (
              <Box
                py="3"
                borderRadius={6}
                flexDirection="row"
                justifyContent={'center'}
                alignItems={'center'}
                bg={isPressed ? 'secondary.700' : 'secondary.500'}
                p="5"
                px="7"
                rounded="8"
                style={{
                  transform: [
                    {
                      scale: isPressed ? 0.96 : 1,
                    },
                  ],
                }}>
                <Svg width="25" height="14" viewBox="0 0 25 14" fill="none">
                  <Path
                    d="M14.2377 11.9884C14.2377 12.8232 13.5683 13.5 12.7426 13.5C11.9169 13.5 11.2475 12.8232 11.2475 11.9884C11.2475 11.1535 11.9169 10.4767 12.7426 10.4767C13.5683 10.4767 14.2377 11.1535 14.2377 11.9884Z"
                    fill="white"
                  />
                  <Path
                    d="M19.62 11.9884C19.62 12.8232 18.9506 13.5 18.1249 13.5C17.2992 13.5 16.6298 12.8232 16.6298 11.9884C16.6298 11.1535 17.2992 10.4767 18.1249 10.4767C18.9506 10.4767 19.62 11.1535 19.62 11.9884Z"
                    fill="white"
                  />
                  <Path
                    fill-rule="evenodd"
                    clip-rule="evenodd"
                    d="M9.29388 0.921265C9.4584 0.65895 9.74425 0.5 10.0515 0.5H16.6298C17.1252 0.5 17.5269 0.906067 17.5269 1.40698C17.5269 1.90789 17.1252 2.31395 16.6298 2.31395H11.4661L13.4396 6.54651H17.7056L20.2823 1.02022C20.4304 0.702643 20.7464 0.5 21.0937 0.5H23.2082C23.7036 0.5 24.1052 0.906067 24.1052 1.40698C24.1052 1.90789 23.7036 2.31395 23.2082 2.31395H21.6625L19.0858 7.84024C18.9377 8.15782 18.6217 8.36047 18.2744 8.36047H12.8708C12.5235 8.36047 12.2074 8.15782 12.0593 7.84024L9.24005 1.79373C9.10905 1.51277 9.12936 1.18358 9.29388 0.921265Z"
                    fill="white"
                  />
                  <Path
                    fill-rule="evenodd"
                    clip-rule="evenodd"
                    d="M4.03965 2.53125C4.69153 2.53125 5.21998 3.0769 5.21998 3.75V5.375H6.79375C7.44563 5.375 7.97408 5.92065 7.97408 6.59375C7.97408 7.26685 7.44563 7.8125 6.79375 7.8125H5.21998V9.4375C5.21998 10.1106 4.69153 10.6562 4.03965 10.6562C3.38777 10.6562 2.85932 10.1106 2.85932 9.4375V7.8125H1.28555C0.633675 7.8125 0.105225 7.26685 0.105225 6.59375C0.105225 5.92065 0.633675 5.375 1.28555 5.375H2.85932V3.75C2.85932 3.0769 3.38777 2.53125 4.03965 2.53125Z"
                    fill="white"
                  />
                </Svg>
                <Text color="#FFF" marginLeft={2} fontFamily={'Cairo'}>
                  تعديل
                </Text>
              </Box>
            );
          }}
        </Pressable>
        <Pressable onPress={() => navigation.navigate('Product')}>
          {({isPressed}) => {
            return (
              <Box
                py="3"
                borderRadius={6}
                flexDirection="row"
                justifyContent={'center'}
                alignItems={'center'}
                marginLeft={2}
                bg={isPressed ? 'danger.500' : 'danger.300'}
                p="5"
                px="7"
                rounded="8"
                style={{
                  transform: [
                    {
                      scale: isPressed ? 0.96 : 1,
                    },
                  ],
                }}>
                <Svg width="25" height="14" viewBox="0 0 25 14" fill="none">
                  <Path
                    d="M14.2377 11.9884C14.2377 12.8232 13.5683 13.5 12.7426 13.5C11.9169 13.5 11.2475 12.8232 11.2475 11.9884C11.2475 11.1535 11.9169 10.4767 12.7426 10.4767C13.5683 10.4767 14.2377 11.1535 14.2377 11.9884Z"
                    fill="white"
                  />
                  <Path
                    d="M19.62 11.9884C19.62 12.8232 18.9506 13.5 18.1249 13.5C17.2992 13.5 16.6298 12.8232 16.6298 11.9884C16.6298 11.1535 17.2992 10.4767 18.1249 10.4767C18.9506 10.4767 19.62 11.1535 19.62 11.9884Z"
                    fill="white"
                  />
                  <Path
                    fill-rule="evenodd"
                    clip-rule="evenodd"
                    d="M9.29388 0.921265C9.4584 0.65895 9.74425 0.5 10.0515 0.5H16.6298C17.1252 0.5 17.5269 0.906067 17.5269 1.40698C17.5269 1.90789 17.1252 2.31395 16.6298 2.31395H11.4661L13.4396 6.54651H17.7056L20.2823 1.02022C20.4304 0.702643 20.7464 0.5 21.0937 0.5H23.2082C23.7036 0.5 24.1052 0.906067 24.1052 1.40698C24.1052 1.90789 23.7036 2.31395 23.2082 2.31395H21.6625L19.0858 7.84024C18.9377 8.15782 18.6217 8.36047 18.2744 8.36047H12.8708C12.5235 8.36047 12.2074 8.15782 12.0593 7.84024L9.24005 1.79373C9.10905 1.51277 9.12936 1.18358 9.29388 0.921265Z"
                    fill="white"
                  />
                  <Path
                    fill-rule="evenodd"
                    clip-rule="evenodd"
                    d="M4.03965 2.53125C4.69153 2.53125 5.21998 3.0769 5.21998 3.75V5.375H6.79375C7.44563 5.375 7.97408 5.92065 7.97408 6.59375C7.97408 7.26685 7.44563 7.8125 6.79375 7.8125H5.21998V9.4375C5.21998 10.1106 4.69153 10.6562 4.03965 10.6562C3.38777 10.6562 2.85932 10.1106 2.85932 9.4375V7.8125H1.28555C0.633675 7.8125 0.105225 7.26685 0.105225 6.59375C0.105225 5.92065 0.633675 5.375 1.28555 5.375H2.85932V3.75C2.85932 3.0769 3.38777 2.53125 4.03965 2.53125Z"
                    fill="white"
                  />
                </Svg>
                <Text
                  color="danger.800"
                  fontWeight={800}
                  marginLeft={2}
                  fontFamily={'Cairo'}>
                  إضافة
                </Text>
              </Box>
            );
          }}
        </Pressable>
      </Box>
    </Box>
  );
};
const List = () => {
  const addresses = [
    {
      id: 123122222223,
      name: 'اسم المستلم ',
      text: 'رقم البيت - اسم الشارع - اسم القطاع - اسم المدينة - اسم الدولة',
      phone: '(123) 456 789 012',
    },
  ];
  return (
    <Container marginTop={4} flex="1" width="100%" mx="auto">
      <Box width="100%" flex="1">
        <FlatList
          style={{flex: 1}}
          data={addresses}
          keyExtractor={(item, index) => `${item.id}-${index}`}
          renderItem={({item, index}) => <Item item={item} index={index} />}
        />
      </Box>
    </Container>
  );
};

export default List;
